Autodesk.Revit.Creation.Application.NewLoadCombinationArray
Creates a new instance of a LoadCombination array.

Autodesk.Revit.Creation.Application.NewLoadUsageArray
Creates a new instance of a LoadUsage array.

Autodesk.Revit.Creation.Application.NewLoadCaseArray
Creates a new instance of a LoadCase array.

Autodesk.Revit.Creation.Application.NewPoint(Autodesk.Revit.DB.XYZ)
Creates a new geometric point object.
coord: The coordinates of the point.